# -*- coding:utf-8 -*-
# 开发人员: erwei.zheng
# 开发时间: 2023/3/25 14:50
# 文件名称: 递归_三级菜单.py
import shutil

menu = {
    '北京': {
        '海淀': {
            '五道口': {
                'soho': {},
                '网易': {},
                'google': {}
            },
            '中关村': {
                '爱奇艺': {},
                '汽车之家': {},
                'youku': {},
            },
            '上地': {
                '百度': {},
            },
        },
        '昌平': {
            '沙河': {
                '老男孩': {},
                '北航': {},
            },
            '天通苑': {},
            '回龙观': {},
        },
        '朝阳': {},
        '东城': {},
    },
    '上海': {
        '闵行': {
            "人民广场": {
                '炸鸡店': {}
            }
        },
        '闸北': {
            '火车战': {
                '携程': {}
            }
        },
        '浦东': {},
    },
    '山东': {},
}

# print(menu)


total, used, free = shutil.disk_usage('.')
print(f"当前磁盘共: {round(total/1073741824, 2)}GB, 已使用: {round(used/1073741824, 2)}GB, 剩余:{round(free/1073741824, 2)}GB")
# 当前磁盘共: 465.63GB, 已使用: 417.49GB, 剩余:48.14GB

print(globals())
print(locals())
